app/services/notification_service.rb

SELECT "device_tokens"."token" FROM "device_tokens" WHERE (device_type = 'android' and employee_id = 8)
---
    def self.get_tokens(payload, condition, device_type)
        tokens = DeviceToken.where(condition).pluck(:token).compact
        puts "tokens plucked"
        if tokens.present?