app/serializers/point_serializer.rb

SELECT avg(manager_score) FROM "points" WHERE "points"."employee_id" = ?  [["employee_id", 2]]
---
  def avg_score
    Point.where(employee_id: object.employee_id).pluck('avg(manager_score)')