app/controllers/employees/registrations_controller.rb

  def create_first_employee
    if Employee.count==0
    employee = Employee.new(employee_params)
    employee.password='123456'
    if role_check(employee.role) && employee.save
---
SELECT COUNT(*) FROM "employees"
INSERT INTO "employees" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "jti", "name", "employee_no", "mobile_number", "reporting_manager_id", "role") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)