app/controllers/employees/registrations_controller.rb

INSERT INTO "employees" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "jti", "name", "employee_no", "mobile_number", "reporting_manager_id", "role") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    employee = Employee.new(employee_params)
    authorize employee
    if employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? ORDER BY "employees"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    employee = Employee.find(params[:id])