app/controllers/employees/sessions_controller.rb

 def generate_otp
    updated_password = SecureRandom.random_number(100000..999999).to_s
    employee = Employee.find_by(getting_params)
    employee.update!(password: updated_password.to_i)
---
UPDATE "employees" SET "encrypted_password" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["encrypted_password", "[FILTERED]"], ["updated_at", "2023-09-11 06:55:39.430301"], ["id", 9]]

 def respond_to_on_destroy
     jwt_payload = JWT.decode(request.headers["Authorization"].split(" ")[1],
     Rails.application.credentials.fetch(:secret_key_base)).first
     current_employee = Employee.find(jwt_payload["sub"])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]