app/controllers/employees/sessions_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
 def respond_to_on_destroy
  jwt_payload = JWT.decode(request.headers["Authorization"].split(" ")[1],
     Rails.application.credentials.fetch(:secret_key_base)).first
  current_employee = Employee.find(jwt_payload["sub"])