app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers"
---
  def index
    answers = Answer.all