app/controllers/comments_controller.rb

INSERT INTO "comments" ("employee_id", "review_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["employee_id", 6], ["review_id", 4], ["comment", "Than you"], ["created_at", "2023-10-04 04:59:07.310111"], ["updated_at", "2023-10-04 04:59:07.310111"]]
INSERT INTO "comments" ("employee_id", "review_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["employee_id", 8], ["review_id", 2], ["comment", "i am good at basics i will get in depth knowledge"], ["created_at", "2023-09-08 07:26:54.942310"], ["updated_at", "2023-09-08 07:26:54.942310"]]
UPDATE "comments" SET "employee_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["employee_id", 2], ["updated_at", "2023-10-04 04:59:07.383529"], ["id", 3]]
---
    def create
        comment = Comment.create(comment_params)
        comment.employee_id=current_employee.id
        if comment.save