app/controllers/device_tokens_controller.rb

    def create
        device= DeviceToken.new(device_params)
        device.employee_id = current_employee.id
        if device.save
---
INSERT INTO "device_tokens" ("employee_id", "token", "device_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["employee_id", 1], ["token", "[FILTERED]"], ["device_type", "ios"], ["created_at", "2023-10-02 16:45:36.794343"], ["updated_at", "2023-10-02 16:45:36.794343"]]

    def index
        devices = DeviceToken.all
---
SELECT "device_tokens".* FROM "device_tokens"