app/controllers/employees_controller.rb

  def index
    employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def show
    employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    employee = Employee.create(employee_params)
    #authorize employee
    if employee.save
---
UPDATE "employees" SET "encrypted_password" = ?, "updated_at" = ?, "role" = ? WHERE "employees"."id" = ?  [["encrypted_password", "[FILTERED]"], ["updated_at", "2023-09-08 05:52:24.885275"], ["role", "ur_lead"], ["id", 8]]

  def update
    employee = Employee.find(params[:id])
    #authorize employee
    if employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "employees" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["email", "hr@gmail.com"], ["encrypted_password", "[FILTERED]"], ["updated_at", "2023-05-20 05:32:53.885069"], ["id", 1]]

  def destroy
    employee = Employee.find(params[:id])
    #authorize employee
    employee.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 13]]

  def roles
    employee = Employee.find(params[:id])
    render json: employee.roles.distinct, status: 200
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def assigned_members
    employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def assigned_manager
    employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def assigned_teamlead
    employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def queries
    employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? ORDER BY "employees"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def scores
    employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? ORDER BY "employees"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def reviews
    employee=Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? ORDER BY "employees"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]