app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."reporting_manager_id" = ?  [["reporting_manager_id", 2]]
---
  def subordinates
    employee = current_employee
    if employee.role = "ur_manager"
      subordinates = Employee.where(reporting_manager_id:employee.id)

SELECT "employees".* FROM "employees"
---
  def all_employees
    employees = Employee.all

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? ORDER BY "employees"."id" ASC LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def find_params
    @employee = Employee.find(params[:id])