app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."manager_id" = ?  [["manager_id", 1]]
---
  def subordinates
    manager = Employee.find(params[:id])