app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."feedback_type" = ?  [["feedback_type", "good"]]
---
    def get_individual_feedback_type
        feedback=Feedback.where(feedback_type:params[:feedback_type])

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."flag" = ?  [["flag", 1]]
---
    def flag_based_records
        feedback=Feedback.where(flag:params[:flag])

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_feedback
        @feedback=Feedback.find(params[:id])