app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."subordinate_id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def comments
      feedback=Feedback.find(params[:id])
        authorize feedback
      if feedback.subordinate_id.present?