app/controllers/feedbacks_controller.rb

    def index
        feedback=Feedback.all
---
SELECT "feedbacks".* FROM "feedbacks"

    def show
        feedback = Feedback.find(params[:id])
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        feedback = Feedback.new(feedback_params)
        authorize feedback
        if feedback.save
---
INSERT INTO "feedbacks" ("review", "month", "employee_id", "created_at", "updated_at", "subordinate_id", "before") VALUES (?, ?, ?, ?, ?, ?, ?)  [["review", "m"], ["month", "may"], ["employee_id", 4], ["created_at", "2023-05-18 09:07:36.471708"], ["updated_at", "2023-05-18 09:07:36.471708"], ["subordinate_id", 2], ["before", 1]]

    def update
        feedback = Feedback.find(params[:id])
        authorize feedback
        if feedback.update(feedback_params)
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "feedbacks" SET "updated_at" = ?, "subordinate_id" = ? WHERE "feedbacks"."id" = ?  [["updated_at", "2023-05-18 09:14:18.208096"], ["subordinate_id", 8], ["id", 7]]

    def destroy
        feedback=Feedback.find(params[:id])
        authorize feedback
        feedback.destroy
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "feedbacks" WHERE "feedbacks"."id" = ?  [["id", 7]]

    def manager_feedback
        feedback=Feedback.find(params[:id])
        authorize feedback
        if feedback.update(manager_feedback_params)
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "feedbacks" SET "manager_feedback" = ?, "manager_id" = ?, "updated_at" = ? WHERE "feedbacks"."id" = ?  [["manager_feedback", "mf"], ["manager_id", 4], ["updated_at", "2023-05-19 07:14:17.324685"], ["id", 6]]

    def comments
        feedback=Feedback.find(params[:id])
        authorize feedback
        if feedback.manager_feedback.present?
            feedback.update(comment_param)
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "feedbacks" SET "comments" = ?, "updated_at" = ? WHERE "feedbacks"."id" = ?  [["comments", "satisfied"], ["updated_at", "2023-05-19 07:18:08.434078"], ["id", 6]]