app/controllers/one_on_ones_controller.rb

  def create
    meeting = @employee.team_one_on_ones.create(meeting_params)
    authorize meeting
    if meeting.save
---
INSERT INTO "one_on_ones" ("member_id", "date", "time", "repeat_monthly", "notes", "created_at", "updated_at", "employee_id", "rating") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "one_on_ones" SET "time" = ?, "updated_at" = ? WHERE "one_on_ones"."id" = ?  [["time", "2000-01-01 12:38:00"], ["updated_at", "2023-09-08 06:22:37.204534"], ["id", 2]]

  def update
    authorize @one_on_one
    if @one_on_one.update(meeting_params)
---
UPDATE "one_on_ones" SET "date" = ?, "updated_at" = ? WHERE "one_on_ones"."id" = ?  [["date", "2023-10-12"], ["updated_at", "2023-09-21 05:28:37.851647"], ["id", 8]]

  def destroy
    authorize @one_on_one
    @one_on_one.destroy
---
DELETE FROM "one_on_ones" WHERE "one_on_ones"."id" = ?  [["id", 8]]

  def reviews
    one_on_one = OneOnOne.find(params[:id])
    reviews = one_on_one.reviews
    reviews = reviews.where(review_type: params[:review_type]) if params[:review_type].present?
---
SELECT "one_on_ones".* FROM "one_on_ones" WHERE "one_on_ones"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."one_on_one_id" = ?  [["one_on_one_id", 7]]

  def rating
    one_on_one = OneOnOne.find(params[:id])
---
SELECT "one_on_ones".* FROM "one_on_ones" WHERE "one_on_ones"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_employee
    @employee = Employee.find(params[:employee_id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def set_one_on_one
    @one_on_one = OneOnOne.find(params[:id])
---
SELECT "one_on_ones".* FROM "one_on_ones" WHERE (employee_id=2)