app/controllers/points_controller.rb

SELECT "points".* FROM "points"
---
  def index
    points = Point.all

SELECT "points".* FROM "points" WHERE "points"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    point = Point.find(params[:id])

INSERT INTO "points" ("self_score", "month", "employee_id", "created_at", "updated_at", "manager_score", "manager_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["self_score", "4"], ["month", "april"], ["employee_id", 2], ["created_at", "2023-05-19 05:02:10.846864"], ["updated_at", "2023-05-19 05:02:10.846864"], ["manager_score", nil], ["manager_id", nil]]
---
  def create
    point = Point.new(point_params)
    # authorize point
    if point.save

SELECT "points".* FROM "points" WHERE "points"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "points" SET "updated_at" = ?, "manager_id" = ? WHERE "points"."id" = ?  [["updated_at", "2023-05-19 05:07:34.532772"], ["manager_id", 4], ["id", 1]]
---
  def update
    point = Point.find(params[:id])
    authorize point
    if point.update(point_params)

SELECT "points".* FROM "points" WHERE "points"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "points" SET "updated_at" = ?, "manager_score" = ? WHERE "points"."id" = ?  [["updated_at", "2023-05-19 05:04:02.356681"], ["manager_score", "3.5"], ["id", 6]]
---
  def manager_score
    point = Point.find(params[:id])
    authorize point
    if point.update(manager_score_params)