app/controllers/questions_controller.rb

  def show
    question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    question = Question.new(question_params)
    authorize question
    if question.save
---
INSERT INTO "questions" ("query", "employee_id", "clarified", "remarks", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["query", "Query1.3"], ["employee_id", 2], ["clarified", nil], ["remarks", nil], ["created_at", "2023-05-17 17:38:02.058743"], ["updated_at", "2023-05-17 17:38:02.058743"]]

  def update
    question = Question.find(params[:id])
    authorize question
    if question.update(question_params)
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "questions" SET "employee_id" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["employee_id", 3], ["updated_at", "2023-05-18 04:49:02.668959"], ["id", 5]]

  def destroy
    question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]