app/controllers/reviews_controller.rb

    def show
        review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        review = Review.create(review_params)
---
INSERT INTO "reviews" ("one_on_one_id", "review_type", "manager_review", "flag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["one_on_one_id", 1], ["review_type", "work-type"], ["manager_review", "Nice"], ["flag", 1], ["created_at", "2023-10-03 12:45:52.285167"], ["updated_at", "2023-10-03 12:45:52.285167"]]

    def update
        if @review.update(review_params)
---
UPDATE "reviews" SET "review_type" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["review_type", "work-type"], ["updated_at", "2023-10-03 12:41:44.655508"], ["id", 4]]

    def find_by_type
        reviews = Review.where("review_type=?",params[:review_type])
---
SELECT "reviews".* FROM "reviews" WHERE (review_type='work-type')

    def comments
        review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def find_params
        @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]